var tipuesearch = {"pages":[{"title":"About","tags":"page","text":"Introduction Welcome, and thanks for checking out my page! If you want to learn more about me then this is the place to be. Briefly, I'm a husband, father, mathematician, computer scientist, physicist, biologist, and nerd (not necessarily in that order). Education BS - Mathematics (2008) MS - Mathematics (2010) MS - Computer Science (2013) PhD - Computational Science (2014) Experience Mgr. Bioinformatics Soft. Dev. , St Jude Children's Research Hospital (2018) Sr. Software Engineer , St Jude Children's Research Hospital (2017) HPC Specialist , St Jude Children's Research Hospital (2015) Math Instructor , Columbia State Community College (2012) Math Instructor , Middle Tennessee State University (2009) Math Instructor , Nashville State Community College (2008) Director / Tutor , The Hundley Center for Academic Enrichment (2006) Freelance Tutor , Self (2005)","loc":"/pages/about/","url":"/pages/about/"},{"title":"Contact","tags":"page","text":"Want to get in touch with me? Fill out the form below to send me a message and I will try to get back to you within 24 hours! Name Email Address Phone Number Message Send","loc":"/pages/contact/","url":"/pages/contact/"},{"title":"Research","tags":"page","text":"Publications Michael, J. R. (2014). Analysis of Thermal Motion Effects on the Electron Density via Computational Simulations (Doctoral dissertation, MIDDLE TENNESSEE STATE UNIVERSITY). Michael, J. R., & Koritsanszky, T. (2015). Computational analysis of thermal-motion effects on the topological properties of the electron density. Acta Cryst A, 71(2), 225-234. Michael, J. R., & Volkov, A. (2015). Density- and wavefunction-normalized Cartesian spherical harmonics for l ≤ 20. Acta Cryst A, 71(2), 245-249. Michael, J. R., & Koritsanszky, T. (2015). Validation of convolution approximation to the thermal-average electron density. J Math Chem, 53(1), 250-259. Michael, J. R., & Koritsanszky, T. (2017). On the error in the nucleus-centered multipolar expansion of molecular electron density and its topology: A direct-space computational study. J Chem Phys, 146(20), 204105. Ferrolino, Mylene & Mitrea, Diana & Michael, J. Robert & Kriwacki, Richard. (2018). Compositional adaptability in NPM1-SURF6 scaffolding networks enabled by dynamic switching of phase separation mechanisms. Nature Communications. 9. 10.1038/s41467-018-07530-1","loc":"/pages/research/","url":"/pages/research/"},{"title":"Hello World!","tags":"random","text":"Hello world! Sorry, I had to - it's my first blog post. I have tried blogging before and used wordpress, etc. (I even tried Blogger back in the day), but now I actually built a blog with Pelican and I'm pretty excited that it actually seems to work. Note that I'm not a web developer (yet!). I'm more of a HPC developer / mathematician so putting together a website is pretty exciting for me. I'll try to keep this blog on a reasonably professional level, mostly discussing tech and math. However, I reserve the right to blog about my adventures as a husband and father of two. I might even slip in a dad joke or two.","loc":"/posts/2019/Nov/07/hello-world/","url":"/posts/2019/Nov/07/hello-world/"}]};